
/*
Домашка:

1.  Ви прийшли в Макдональдз з трьома друзями.
    Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
    Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
    то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
    то виводити в консоль текст "Ми йдемо в інше кафе"
    (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)

    

2.  Напишіть умовну конструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
    Результат виводити в консоль.

3.  Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
    Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
    Результат виводити в консоль.

4.  За номером пори року вивести назву цієї пори року використовуючи оператор if-else-if
    Результат виводити в консоль.

5.  Задано 3 числа (a, b, c), які не рівні між собою.
    Визначити середнє мід цими трьома числами
    (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
    Використати вкладені оператори if
    Результат виводити в консоль.

6.  Задано номер дня тижня.
    За заданим номером вивести назву дня тижня використовуючи switch.
    Результат виводити в консоль.

7.  За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
    Математичні операції для обчислення: "+", "-", "*", "/".
    Результат виводити в консоль.

8.*  Використовуючи властивості рядків (тип string), та регулярний вираз (regular expression) видалити голосні букви зі слова.

9.*  Використовуючи оператор if реалізувати логіку переводу метрів в кілометри,
    так щоб в консоль виводився результат обчислень з правильним закнченням.
    Наприклад: 1000 метрів це 1 кілометр;  32 метри це 0,02 кілометра; 3 кілометри і т.д.

    Відмінювання для "метр" (аналогічні закінчення будуть і для слова "кілометр")

    Підказка(https://ukr-lifehacks.ed-era.com/rozdil-9/zvyazok_chislivnykiv)
*/

let hamburgers = 10;
let fries = 2;

if((hamburgers >= 4) && (fries >= 1)){
    console.log("всі наїлися")
}
else
    console.log("Ми йдемо в інше кафе")



let num = 1901;

    if(num >= 1000 && num <= 1900){
        console.log('win');
    } 
    else
        console.log('not win')


let num1 = 10;

    if(!(num1 >= 1000 && num1 <= 1900)){
        console.log('win');
    } 
    else
        console.log('not win')

let num2 = 1901;

    if(num2 < 1000 || num2 > 1900){
            console.log('win');
    } 
    else
        console.log('not win')



let month = 9;
if (month === 12 || month === 1 || month === 2) {
    console.log('zima');
        }
else if (month === 3 || month === 4 || month === 5) {
    console.log('vesna');
        }
else if (month === 6 || month === 7 || month === 8) {
    console.log('leto');
        }
else {
    console.log('osen');
        }

        
        
let a = 3;
let b = 1;
let c = 2;

    if(a > b && a < c || a < b && a > c){
        console.log('среднее число A');
    } else if (b > a && b < c || b < a && b > c){
        console.log('среднее число B');
    } else {
        console.log('среднее число C');
    }

let number = '8';

 switch(number){
    case '1':
    console.log('пн')
        break;
    case '2': 
console.log('вт')
        break;
    case '3':
console.log('ср')
        break;
    case '4':
console.log('чт')
        break;
    case '5': 
console.log('пт')
        break;
    case '6':
console.log('сб')
        break;
    case '7':
console.log('вс')
        break;
    default: 
console.log('Це не день тиждня')
        break; 
        }

        
    


let num3= 100
    switch (num3*2){
          case 200:
        console.log('множення на 2') 
              break;
          default: 
        console.log('дефолтне значення')
                  break;
          }
let num4 = 100
    switch (num4+2){
              case 102:
        console.log('додавання до числа') 
              break;
              default: 
        console.log('дефолтне значення')
                  break;
          }
let num5 = 100
    switch (num5-2){
              case 98:
        console.log('віднімання від числа') 
              break;
              default: 
        console.log('дефолтне значення')
                  break;
          }
let num6 = 100
    switch (num6/2){
              case 50:
        console.log('ділення числа на 2') 
              break;
              default: 
        console.log('дефолтне значення')
                  break;
          }



